{"country.china":{"en":"China","zh":"中国"},"country.turkey":{"en":"Turkey","zh":"土耳其"},"country.thailand":{"en":"Thailand","zh":"泰国"},"country.plane":{"en":"On a Plane","zh":"在飞机上"},"author.xanthous.title":{"en":"lorem","zh":"lorem"},"author.xanthous.bio":{"en":"We build software to help business grow.","zh":"lorem"},"author.alexzhao.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.alexzhao.bio":{"en":"lorem","zh":"lorem"},"author.osmanmesutozcan.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.osmanmesutozcan.bio":{"en":"lorem","zh":"lorem"},"author.simonliang.title":{"en":"Full Stack Java / JavaScript Engineer, AWS / Elasticsearch Expert","zh":"全栈Java / JavaScript工程师，AWS / Elasticsearch专家"},"author.simonliang.bio":{"en":"With 5 years of professional experience, and extensive knowledge of AWS Architecture and Elasticsearch, I am always ready to solve a technical challenge. Having worked in big corporate and startups, I also understand how to ship high quality software on time.","zh":"五年工作经验，并对AWS架构和Elasticsearch有丰富的经验。在大公司和初创公司的经历使我懂得如何高质量按时交付项目。"},"author.necmttn.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.necmttn.bio":{"en":"lorem","zh":"lorem"},"author.chrischen.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.chrischen.bio":{"en":"lorem","zh":"lorem"},"techstack.react.desc":{"en":"React is a declarative, efficient, and flexible JavaScript library for building user interfaces, maintained by Facebook. At Xanthous Tech, we use React to build user-facing part of the project, on browsers and mobile devices.","zh":"React是Facebook开源的UI框架。"},"techstack.graphql.desc":{"en":"GraphQL is a query language and execution engine tied to any backend service maintained by Facebook. At Xanthous we use GraphQL extensively to build production grade projects with rich data presentation, which effectively provide smooth collaboration between frontend and backend developers.","zh":"GraphQL是Facebook制定的数据查询语言规范。"},"techstack.apollo.desc":{"en":"The Apollo GraphQL platform is an implementation of GraphQL that helps you manage data from the cloud to your UI. It’s incrementally adoptable and can be layered over your existing services, including REST APIs and databases. Apollo includes two open-source libraries for the client and server, in addition to developer tooling that provides everything you need to run a graph API in production with confidence.","zh":"Apollo"},"techstack.styled components.desc":{"en":"Utilising tagged template literals (a recent addition to JavaScript) and the power of CSS, styled-components allows you to write actual CSS code to style your components. It also removes the mapping between components and styles – using components as a low-level styling construct could not be easier!","zh":"Styled Components"},"techstack.loopback.desc":{"en":"LoopBack is a highly-extensible, open-source Node.js framework that enables you to create dynamic end-to-end REST APIs with little or no coding.","zh":"loopback"},"techstack.lombok.desc":{"en":"Project Lombok is a java library that automatically plugs into your editor and build tools, spicing up your java. Never write another getter or equals method again, with one annotation your class has a fully featured builder, Automate your logging variables, and much more.","zh":"lombok"},"techstack.typeorm.desc":{"en":"TypeORM is an ORM that can run in NodeJS, Browser, Cordova, PhoneGap, Ionic, React Native, NativeScript, Expo, and Electron platforms and can be used with TypeScript and JavaScript (ES5, ES6, ES7, ES8). Its goal is to always support the latest JavaScript features and provide additional features that help you to develop any kind of application that uses databases - from small applications with a few tables to large scale enterprise applications with multiple databases.","zh":"typeorm"},"techstack.grpc.desc":{"en":"gRPC is a high-performance, open-source universal RPC framework by Google. At Xanthous Tech, we use gRPC to construct microservice architecture coordinating between different backend programming languages, without sacrificing individual developer productivity and happiness.","zh":"gRPC是谷歌开源的一个RPC框架。"},"techstack.aws.desc":{"en":"Amazon Web Services offers reliable, scalable, and inexpensive cloud computing services. At Xanthous Tech, we have several AWS Solutions Architects with deep knowledge on how to effectively build and maintain AWS Stacks to achieve their full potential, and scale out as needed.","zh":"亚马逊云服务AWS是行业领先的云服务。"},"techstack.aws lambda.desc":{"en":"AWS Lambda is a core computing unit in the AWS Serverless Stack. At Xanthous Tech, we know how to effectively use AWS Lambda to build complex serverless data pipelines at low cost.","zh":"AWS Lambda是亚马逊云服务推出的无服务器云函数组件。"},"techstack.aws appsync.desc":{"en":"AWS AppSync","zh":"AWS AppSync"},"techstack.spring boot.desc":{"en":"Spring Boot","zh":"Spring Boot"},"techstack.reactor.desc":{"en":"Reactor","zh":"Reactor"},"techstack.elasticsearch.desc":{"en":"Elasticsearch is a distributed document-based search and analytics engine that is capable of processing millions of records of full-text documents. At Xanthous we help a lot of our clients build performant data analytics pipeline and search engine using Elasticsearch and capable of optimizing and managing large Elasticsearch clusters.","zh":"Elasticsearch"},"general.nav.home":{"en":"Home","zh":"首页"},"general.nav.about":{"en":"About","zh":"关于"},"general.nav.blog":{"en":"Blog","zh":"博客"},"general.nav.projects":{"en":"Projects","zh":"项目"},"general.nav.contact":{"en":"Contact","zh":"联系"},"general.splash.title1":{"en":"We build software","zh":"我们协助企业"},"general.splash.title2":{"en":"to help business grow.","zh":"共同成长"},"general.splash.intro-text":{"en":"We're eager to help data driven companies achieve their business goals. All that is possible thanks to our distributed team of highly motivated individuals.","zh":"我们渴望通过软件帮助企业达成商业上的目标"},"general.splash.lets-chat":{"en":"Let's Chat!","zh":"聊一聊"},"general.intro.whoWeAre.title":{"en":"Who We Are","zh":"我们是谁"},"general.intro.whoWeAre.content":{"en":"We are a team of freelancers who love to help startups grow. We are used to work in startup environments and understand what it takes to build a product from 0 to 1, and from 1 to 100.We are a team of freelancers who love to help startups grow. We are used to work in startup environments and understand what it takes to build a product from 0 to 1, and from 1 to 100.","zh":"我们是一个帮初创企业成长的团队，我们熟悉初创公司的环境和节奏，懂得如何从0到1地打造产品，并且能够把产品从1推向100。"},"general.intro.whatWeDo.title":{"en":"What We Do","zh":"我们做什么"},"general.intro.whatWeDo.content":{"en":"We have helped startups and teams from all over the world to implement the idea from scratch, optimize and improve their product performance and development workflow, and take their businesses to the next stage ASAP.","zh":"我们给海内外的初创团队和企业制作产品原型，优化产品性能和开发流程，以最快的速度把业务推进到一个新的高度。"},"general.intro.howWeDoIt.title":{"en":"How We Do It","zh":"我们怎么做"},"general.intro.howWeDoIt.content":{"en":"We use cutting-edge technology (Big Data, IoT, Machine Learning) to boost the technical depth of the ideas and make them come true.","zh":"我们用最前沿的技术（大数据、物联网、人工智能），通过技术手段去实现企业的初创理念，达到商业上的成功"},"general.projects.title":{"en":"Project Highlights","zh":"项目案例"},"general.projects.subtitle":{"en":"Some of recent projects we have completed","zh":"近期完成项目"},"general.faq.start.question":{"en":"How do we start a project?","zh":"我们如何开始一个项目？"},"general.faq.start.answer":{"en":"If you would like us to help you solve your problems, please feel free to reach out, and we can have as many conversations/conference meetings as needed for both of us to find out what the actual issues are. Then we will take our time to evaluate together on the possible solutions we can try to solve. Once we land on a plan with what exactly we are building, how many of us it takes, how long it takes to finish, and finally get all the logistics cleared out, we start our development phase.","zh":"我们前期会进行充分的沟通，了解客户的想法，并梳理成可以实现的方案和计划，根据计划我们会调用相关的人员进入项目，估算工时，等双方认可方案和人员安排时，项目进入开发阶段。"},"general.faq.tools.question":{"en":"How do we collaborate during the development phase?","zh":"在开发阶段我们如何进行合作？"},"general.faq.tools.answer":{"en":"We use modern tools to ensure transparency (tasks and progress via Trello, IM via Slack/Wechat, source code via GitHub/GitLab, but most importantly, a *working* demo at all times, so you can constantly visualize the progress), and fluidity (being able to visualize progress meaning that we can cater to some amount of change on a weekly basis) during the entire development process. We do whatever it takes to keep this remote collaboration smooth, and make it to the timeline we want. Time is essence in the startup world.","zh":"我们使用自研的项目管理软件，并结合微信，每周制定工作计划，同步沟通项目进度，并且会有可运行的demo，确保项目进行有条不紊，并按时交付。"},"general.faq.button.email-support":{"en":"Email Support","zh":"Email"},"general.faq.button.live-support":{"en":"Live Support","zh":"实时聊天"}}