{"country.china":{"en":"China","zh":"中国"},"country.turkey":{"en":"Turkey","zh":"土耳其"},"country.thailand":{"en":"Thailand","zh":"泰国"},"country.plane":{"en":"On a Plane","zh":"在飞机上"},"author.xanthous.title":{"en":"lorem","zh":"lorem"},"author.xanthous.bio":{"en":"We build software to help business grow.","zh":"lorem"},"author.alexzhao.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.alexzhao.bio":{"en":"lorem","zh":"lorem"},"author.osmanmesutozcan.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.osmanmesutozcan.bio":{"en":"lorem","zh":"lorem"},"author.simonliang.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.simonliang.bio":{"en":"lorem","zh":"lorem"},"author.necmttn.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.necmttn.bio":{"en":"lorem","zh":"lorem"},"author.chrischen.title":{"en":"Full Stack Developer","zh":"全栈开发者"},"author.chrischen.bio":{"en":"lorem","zh":"lorem"},"techstack.react.desc":{"en":"React is a declarative, efficient, and flexible JavaScript library for building user interfaces, maintained by Facebook. At Xanthous Tech, we use React to build user-facing part of the project, on browsers and mobile devices.","zh":"全栈开发者"},"techstack.graphql.desc":{"en":"GraphQL is a query language and execution engine tied to any backend service maintained by Facebook. At Xanthous we use GraphQL extensively to build production grade projects with rich data presentation, which effectively provide smooth collaboration between frontend and backend developers.","zh":"lorem"},"techstack.grpc.desc":{"en":"gRPC is a high-performance, open-source universal RPC framework by Google. At Xanthous Tech, we use gRPC to construct microservice architecture coordinating between different backend programming languages, without sacrificing individual developer productivity and happiness.","zh":"lorem"},"techstack.aws.desc":{"en":"Amazon Web Services offers reliable, scalable, and inexpensive cloud computing services. At Xanthous Tech, we have several AWS Solutions Architects with deep knowledge on how to effectively build and maintain AWS Stacks to achieve their full potential, and scale out as needed.","zh":"lorem"},"techstack.aws lambda.desc":{"en":"AWS Lambda is a core computing unit in the AWS Serverless Stack. At Xanthous Tech, we know how to effectively use AWS Lambda to build complex serverless data pipelines at low cost.","zh":"lorem"},"techstack.aws appsync.desc":{"en":"AWS Appsync","zh":"lorem"},"techstack.spring boot.desc":{"en":"Spring Boot","zh":"lorem"},"techstack.reactor.desc":{"en":"Reactor","zh":"Reactor"},"general.splash.title1":{"en":"We build software","zh":"lorem"},"general.splash.title2":{"en":"to help business grow.","zh":"lorem"},"general.splash.intro-text":{"en":"We're eager to help data driven companies achieve their business goals. All that is possible thanks to our distributed team of highly motivated individuals.","zh":"lorem upsum"},"general.splash.lets-chat":{"en":"Let's Chat!","zh":"lorem"},"general.intro.whoWeAre.title":{"en":"Who We Are","zh":"lorem"},"general.intro.whoWeAre.content":{"en":"We are a team of freelancers who love to help startups grow. We are used to work in startup environments and understand what it takes to build a product from 0 to 1, and from 1 to 100.We are a team of freelancers who love to help startups grow. We are used to work in startup environments and understand what it takes to build a product from 0 to 1, and from 1 to 100.","zh":"lorem"},"general.intro.whatWeDo.title":{"en":"What We Do","zh":"lorem"},"general.intro.whatWeDo.content":{"en":"We have helped startups and teams from all over the world to implement the idea from scratch, optimize and improve their product performance and development workflow, and take their businesses to the next stage ASAP.","zh":"lorem"},"general.intro.howWeDoIt.title":{"en":"How We Do It","zh":"lorem"},"general.intro.howWeDoIt.content":{"en":"We use cutting-edge technology (Big Data, IoT, Machine Learning) to boost the technical depth of the ideas and make them come true.","zh":"lorem"},"general.projects.title":{"en":"Project Highlights","zh":"lorem"},"general.projects.subtitle":{"en":"Some of recent projects we have complete","zh":"lorem"},"general.faq.start.question":{"en":"How do we start a project?","zh":"lorem"},"general.faq.start.answer":{"en":"If you would like us to help you solve your problems, please feel free to reach out, and we can have as many conversations/conference meetings as needed for both of us to find out what the actual issues are. Then we will take our time to evaluate together on the possible solutions we can try to solve. Once we land on a plan with what exactly we are building, how many of us it takes, how long it takes to finish, and finally get all the logistics cleared out, we start our development phase.","zh":"lorem"},"general.faq.tools.question":{"en":"How do we collaborate during the development phase?","zh":"lorem"},"general.faq.tools.answer":{"en":"We use modern tools to ensure transparency (tasks and progress via Trello, IM via Slack/Wechat, source code via GitHub/GitLab, but most importantly, a *working* demo at all times, so you can constantly visualize the progress), and fluidity (being able to visualize progress meaning that we can cater to some amount of change on a weekly basis) during the entire development process. We do whatever it takes to keep this remote collaboration smooth, and make it to the timeline we want. Time is essence in the startup world.","zh":"lorem"},"general.faq.button.email-support":{"en":"Email Support","zh":"lorem"},"general.faq.button.live-support":{"en":"Live Support","zh":"lorem"}}